RIET/src/Catalogs/CountriesHUBs/CountriesHUBs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CountriesHUBs</name>
  <attributes>
    <name>TMSID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NameForMoveIT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EMailBoxesList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>SanctionsGroup</name>
    <type>
      <types>CatalogRef.SanctionsGroup</types>
    </type>
  </attributes>
  <attributes>
    <name>HUB</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>EMailBoxes</name>
    <attributes>
      <name>EMailBox</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/CountriesHUBs/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизиты();
			
	ПроверитьРеквизиты(Отказ);
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////////

Процедура ДозаполнитьРеквизиты()
	
	Код = ВРег(СокрЛП(Код));
	Наименование = ВРег(СокрЛП(Наименование));
	TMSID = СокрЛП(TMSID);
	NameForMoveIT = СокрЛП(NameForMoveIT);
	
	РГСофтКлиентСервер.СокрЛПКолонокВТаблице(EMailBoxes, "EMailBox");
	ОбщегоНазначения.ОчиститьТаблицуОтСтрокСПустымиРеквизитами(EMailBoxes, "EMailBox");
	
	МассивEMailBoxes = EMailBoxes.ВыгрузитьКолонку("EMailBox");
	EMailBoxesList = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивEMailBoxes, ", ");
	
	Если ЭтоНовый() Тогда
		РГСофт.ЗаполнитьCreation(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////////

Процедура ПроверитьРеквизиты(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Код)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Code' is empty!",
			ЭтотОбъект, "Код", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Name' is empty!",
			ЭтотОбъект, "Наименование", , Отказ);		
	КонецЕсли; 
	
	// Проверим, что TMS ID уникален
	Если ЗначениеЗаполнено(TMSID) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("TMSID", TMSID);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	CountriesHUBs.Представление
			|ИЗ
			|	Справочник.CountriesHUBs КАК CountriesHUBs
			|ГДЕ
			|	CountriesHUBs.TMSID = &TMSID
			|	И НЕ CountriesHUBs.ПометкаУдаления
			|	И CountriesHUBs.Ссылка <> &Ссылка";
			
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"TMS ID '" + TMSID + "' is already used in Country / HUB '" + СокрЛП(Выборка.Представление) + "'!",
				ЭтотОбъект, "TMSID", , Отказ);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
